Charles5150/midi-commander-custom/firmware/Middlewares/ST/STM32_USB_Device_Library/Class/MIDI/Src/usbd_midi.c
/**
  ******************************************************************************
  * @file    usbd_midi.c
  ******************************************************************************

    (CC at)2016 by D.F.Mac. @TripArts Music

*/ 

/* Includes ------------------------------------------------------------------*/
#include "usbd_midi.h"
#include "usbd_desc.h"
#include "stm32f1xx_hal_conf.h"
#include "usbd_ctlreq.h"
#include "stm32f1xx_hal.h"

static uint8_t  USBD_MIDI_Init (USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t  USBD_MIDI_DeInit (USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t  USBD_MIDI_DataIn (USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t  USBD_MIDI_DataOut (USBD_HandleTypeDef *pdev, uint8_t epnum);

static uint8_t  *USBD_MIDI_GetCfgDesc (uint16_t *length);

static void midi_tx_kick(void);

USBD_HandleTypeDef *pInstance = NULL; 

uint32_t APP_Rx_ptr_in  = 0;
uint32_t APP_Rx_ptr_out = 0;
uint32_t APP_Rx_length  = 0;
volatile uint8_t  USB_Tx_State = 0;

__ALIGN_BEGIN uint8_t USB_Rx_Buffer[MIDI_DATA_OUT_PACKET_SIZE] __ALIGN_END ;
__ALIGN_BEGIN uint8_t APP_Rx_Buffer[APP_RX_DATA_SIZE] __ALIGN_END ;


/* USB MIDI interface class callbacks structure */
USBD_ClassTypeDef  USBD_MIDI = 
{
  USBD_MIDI_Init,
  USBD_MIDI_DeInit,
  NULL,
  NULL,
  NULL,
  USBD_MIDI_DataIn,
  USBD_MIDI_DataOut,
  NULL,
  NULL,
  NULL,
  NULL,// HS
  USBD_MIDI_GetCfgDesc,// FS
  NULL,// OTHER SPEED
  NULL,// DEVICE_QUALIFIER
};

/* USB MIDI device Configuration Descriptor */
__ALIGN_BEGIN uint8_t USBD_MIDI_CfgDesc[USB_MIDI_CONFIG_DESC_SIZ] __ALIGN_END =
{
  // configuration descriptor
  0x09, 0x02, 0x65, 0x00, 0x02, 0x01, 0x00, 0x80, 0x31,

  // The Audio Interface Collection
  0x09, 0x04, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00, // Standard AC Interface Descriptor
  0x09, 0x24, 0x01, 0x00, 0x01, 0x09, 0x00, 0x01, 0x01, // Class-specific AC Interface Descriptor
  0x09, 0x04, 0x01, 0x00, 0x02, 0x01, 0x03, 0x00, 0x00, // MIDIStreaming Interface Descriptors
  0x07, 0x24, 0x01, 0x00, 0x01, 0x41, 0x00,             // Class-Specific MS Interface Header Descriptor

  // MIDI IN JACKS
  0x06, 0x24, 0x02, 0x01, 0x01, 0x00,
  0x06, 0x24, 0x02, 0x02, 0x02, 0x00,

  // MIDI OUT JACKS
  0x09, 0x24, 0x03, 0x01, 0x03, 0x01, 0x02, 0x01, 0x00,
  0x09, 0x24, 0x03, 0x02, 0x06, 0x01, 0x01, 0x01, 0x00,

  // OUT endpoint descriptor
  0x09, 0x05, MIDI_OUT_EP, 0x02, 0x40, 0x00, 0x00, 0x00, 0x00,
  0x05, 0x25, 0x01, 0x01, 0x01,

  // IN endpoint descriptor
  0x09, 0x05, MIDI_IN_EP, 0x02, 0x40, 0x00, 0x00, 0x00, 0x00,
  0x05, 0x25, 0x01, 0x01, 0x03,
};

static uint8_t USBD_MIDI_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx){
  pInstance = pdev;
  USBD_LL_OpenEP(pdev,MIDI_IN_EP,USBD_EP_TYPE_BULK,MIDI_DATA_IN_PACKET_SIZE);
  USBD_LL_OpenEP(pdev,MIDI_OUT_EP,USBD_EP_TYPE_BULK,MIDI_DATA_OUT_PACKET_SIZE);

  pdev->ep_out[MIDI_OUT_EP & 0xFU].is_used = 1U;
  pdev->ep_in[MIDI_IN_EP & 0xFU].is_used = 1U;

  USBD_LL_PrepareReceive(pdev,MIDI_OUT_EP,(uint8_t*)(USB_Rx_Buffer),MIDI_DATA_OUT_PACKET_SIZE);
  return 0;
}

static uint8_t USBD_MIDI_DeInit (USBD_HandleTypeDef *pdev, uint8_t cfgidx){
  pInstance = NULL;
  USBD_LL_CloseEP(pdev,MIDI_IN_EP);
  USBD_LL_CloseEP(pdev,MIDI_OUT_EP);
  return 0;
}

static uint8_t USBD_MIDI_DataIn (USBD_HandleTypeDef *pdev, uint8_t epnum){
  USB_Tx_State = 0;
  midi_tx_kick();
  return USBD_OK;
}

static uint8_t  USBD_MIDI_DataOut (USBD_HandleTypeDef *pdev, uint8_t epnum)
{      
  uint16_t USB_Rx_Cnt;

  USBD_MIDI_ItfTypeDef *pmidi;
  pmidi = (USBD_MIDI_ItfTypeDef *)(pdev->pUserData);

  USB_Rx_Cnt = ((PCD_HandleTypeDef*)pdev->pData)->OUT_ep[epnum].xfer_count;

  pmidi->pIf_MidiRx(USB_Rx_Buffer, USB_Rx_Cnt);

  USBD_LL_PrepareReceive(pdev,MIDI_OUT_EP,USB_Rx_Buffer,MIDI_DATA_OUT_PACKET_SIZE);
  return USBD_OK;
}



/*
 * Transmit queue.
 *
 * This used to busy-wait for the previous transfer to finish, which made it
 * unusable from an interrupt (and could hang for good if the USB interrupt
 * never ran). Events are now copied into a ring buffer and handed to the
 * endpoint one packet at a time, continuing from the DataIn callback, so
 * sending never blocks. If the queue is full the new events are dropped,
 * which is the least bad option for a MIDI stream.
 */
#define MIDI_TX_RING_SIZE	(256)

static uint8_t midi_tx_ring[MIDI_TX_RING_SIZE];
static volatile uint16_t midi_tx_head = 0;
static volatile uint16_t midi_tx_tail = 0;
__ALIGN_BEGIN static uint8_t midi_tx_chunk[MIDI_DATA_IN_PACKET_SIZE] __ALIGN_END;

// Start the next packet if the endpoint is free. Call with interrupts masked.
static void midi_tx_kick(void){
	if(USB_Tx_State) return;
	if(midi_tx_head == midi_tx_tail) return;

	if(pInstance == NULL || pInstance->dev_state != USBD_STATE_CONFIGURED){
		midi_tx_tail = midi_tx_head;   // not connected: discard
		return;
	}

	uint16_t n = 0;
	while(midi_tx_tail != midi_tx_head && n < MIDI_DATA_IN_PACKET_SIZE){
		midi_tx_chunk[n++] = midi_tx_ring[midi_tx_tail];
		midi_tx_tail = (uint16_t)((midi_tx_tail + 1) % MIDI_TX_RING_SIZE);
	}

	USB_Tx_State = 1;
	if(USBD_LL_Transmit(pInstance, MIDI_IN_EP, midi_tx_chunk, n) != USBD_OK){
		USB_Tx_State = 0;   // retried by the next send or DataIn
	}
}

void USBD_MIDI_SendPacket (uint8_t* buffer, uint8_t len){
	if(pInstance == NULL || pInstance->dev_state != USBD_STATE_CONFIGURED){
		return;
	}

	uint32_t primask = __get_PRIMASK();
	__disable_irq();

	// All of it or none: half an event, or a SysEx with no end, would leave
	// the host misreading everything after it
	uint16_t room = (uint16_t)((midi_tx_tail + MIDI_TX_RING_SIZE - midi_tx_head - 1) % MIDI_TX_RING_SIZE);
	if(len <= room){
		for(uint8_t i=0; i<len; i++){
			midi_tx_ring[midi_tx_head] = buffer[i];
			midi_tx_head = (uint16_t)((midi_tx_head + 1) % MIDI_TX_RING_SIZE);
		}
	}
	midi_tx_kick();

	if(!primask) __enable_irq();
}

static uint8_t *USBD_MIDI_GetCfgDesc (uint16_t *length){
  *length = sizeof (USBD_MIDI_CfgDesc);
  return USBD_MIDI_CfgDesc;
}

uint8_t USBD_MIDI_RegisterInterface(USBD_HandleTypeDef *pdev, USBD_MIDI_ItfTypeDef *fops)
{
  uint8_t ret = USBD_FAIL;
  
  if(fops != NULL){
    pdev->pUserData= fops;
    ret = USBD_OK;    
  }
  
  return ret;
}
